CREATE DATABASE  IF NOT EXISTS `db_study3` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `db_study3`;
-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: db_study3
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `publisher_mst`
--

DROP TABLE IF EXISTS `publisher_mst`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `publisher_mst` (
  `publisher_id` int NOT NULL AUTO_INCREMENT,
  `publisher_name` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`publisher_id`)
) ENGINE=InnoDB AUTO_INCREMENT=512 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `publisher_mst`
--

LOCK TABLES `publisher_mst` WRITE;
/*!40000 ALTER TABLE `publisher_mst` DISABLE KEYS */;
INSERT INTO `publisher_mst` VALUES (1,NULL),(2,''),(3,'(주)문학동네'),(4,'21세기 북스'),(5,'21세기북스'),(6,'Andromedian(로크미디어)'),(7,'Arte(아르테)'),(8,'EBS Books(한국교육방송공사)'),(9,'Humanist'),(10,'Jinhan M&B(진한엠앤비)'),(11,'Jpub'),(12,'Jpub(제이펍)'),(13,'Korea.com:대성'),(14,'MiraeN'),(15,'Playtime(플레이타임)'),(16,'REXmedia(렉스미디어)'),(17,'RHK:알에이치코리아'),(18,'Snowfox'),(19,'Soul society(소울소사이어티)'),(20,'TWIG(티더블유아이지)'),(21,'Whale Books(웨일북)'),(22,'xbooks'),(23,'YBM Sisa.com'),(24,'Youngjin.com(영진닷컴)'),(25,'가갸날'),(26,'가나문화콘텐츠'),(27,'가나출판사'),(28,'개마고원'),(29,'개미'),(30,'갤리온'),(31,'갤리온:웅진씽크빅'),(32,'걷는나무(웅진씽크빅)'),(33,'경성라인'),(34,'경향BP'),(35,'경향미디어'),(36,'계림닷컴'),(37,'계명대학교 출판부'),(38,'고래가 그랬어'),(39,'고래가숨쉬는도서관'),(40,'고려대학교출판부'),(41,'고즈윈'),(42,'공명'),(43,'교유서가'),(44,'교학사'),(45,'국립대구박물관'),(46,'굿위즈덤'),(47,'궁리'),(48,'그린비출판사'),(49,'글담'),(50,'글로세움'),(51,'글사랑'),(52,'글항아리'),(53,'기담문고'),(54,'기원전'),(55,'길'),(56,'길벗'),(57,'김영사'),(58,'꿈결'),(59,'끌리는책'),(60,'나남'),(61,'나무,나무'),(62,'나무[수'),(63,'나무생각'),(64,'나무생각 힐링'),(65,'나무의철학'),(66,'나비의 활주로'),(67,'남해의봄날'),(68,'낮은산'),(69,'내인생의책'),(70,'너머학교'),(71,'넥서스'),(72,'녹색평론사'),(73,'뉴'),(74,'늘봄'),(75,'다산 3.0'),(76,'다산글방'),(77,'다산라이프'),(78,'다산북스'),(79,'다산초당'),(80,'다산초당(다산북스)'),(81,'다섯수레'),(82,'달리'),(83,'담다'),(84,'대교출판'),(85,'대구공업전문대학'),(86,'대구광역시 남구'),(87,'대구광역시 달성군'),(88,'대구광역시립도서관'),(89,'대구광역시립중앙도서관'),(90,'대구교육대학교'),(91,'대구직할시 중구'),(92,'대구투자금융주식회사361'),(93,'대림북스'),(94,'대원키즈'),(95,'대통령 소속 도서관정보정책위원회'),(96,'대한교과서'),(97,'더블'),(98,'더좋은책'),(99,'더퀘스트(길벗)'),(100,'도솔'),(101,'돋을새김'),(102,'돌베개'),(103,'동녘'),(104,'동서문화'),(105,'동아시아'),(106,'동아엠앤비'),(107,'동아일보사'),(108,'동양북스'),(109,'뜨인들'),(110,'뜻이있는사람들'),(111,'라의눈'),(112,'라이온북스'),(113,'라티오'),(114,'랜덤하우스'),(115,'럭스미디어'),(116,'레디셋고'),(117,'로대(Lodae)'),(118,'루비박스'),(119,'루페'),(120,'리더스북'),(121,'마래 M&B'),(122,'마리書舍'),(123,'마산시'),(124,'마일스톤'),(125,'말글빛냄'),(126,'맑은나루'),(127,'매일신문사'),(128,'메이븐'),(129,'명랑한책방'),(130,'명솔출판'),(131,'명진출판'),(132,'모네상스'),(133,'무한'),(134,'문예출판사'),(135,'문원'),(136,'문학동네'),(137,'문학세계사'),(138,'문학의숲'),(139,'문화체육관광부'),(140,'문화체육부'),(141,'뮤진트리'),(142,'미디어일다'),(143,'미래M&B'),(144,'미래엔'),(145,'미래의창'),(146,'미래인'),(147,'민음사'),(148,'민음인'),(149,'바다출판사'),(150,'바이북스'),(151,'박영사'),(152,'범우사'),(153,'범진'),(154,'베프북스'),(155,'별글'),(156,'봄날의책'),(157,'봄볕'),(158,'부글북스'),(159,'부키'),(160,'북극곰'),(161,'북노마드'),(162,'북로그컴퍼니'),(163,'북루덴스'),(164,'북바이북'),(165,'북스타'),(166,'북스톤'),(167,'북이십일'),(168,'북이십일 21세기북스'),(169,'북클라우드'),(170,'북하우스'),(171,'블루무스'),(172,'블루엘리펀트'),(173,'비룡소'),(174,'비즈니스북스'),(175,'삐삐북스'),(176,'사계절'),(177,'사람과나무사이'),(178,'사우'),(179,'사월의책'),(180,'사이언스북스'),(181,'사회평론'),(182,'산책자'),(183,'살림'),(184,'살림출판사'),(185,'삼성출판사'),(186,'삼일사'),(187,'상상나무'),(188,'상상창작소봄'),(189,'상수리'),(190,'새로운현재'),(191,'새마을文庫中央會'),(192,'새문사'),(193,'새잎'),(194,'새콤'),(195,'샘터'),(196,'생각나눔'),(197,'생각비행'),(198,'생각의나무'),(199,'생각정거장'),(200,'생각정원'),(201,'생각하는 책상'),(202,'생각하는책상'),(203,'생능'),(204,'샨티'),(205,'서울대학교출판문화원'),(206,'서울言論人클럽'),(207,'서해문집'),(208,'석문출판사'),(209,'성안당'),(210,'세종서적'),(211,'세종연구원'),(212,'소소의책'),(213,'소울메이트'),(214,'수선재'),(215,'수오서재'),(216,'숲'),(217,'스마트북스'),(218,'스타북스'),(219,'시공사'),(220,'시공주니어'),(221,'시그마북스'),(222,'시대고시기획'),(223,'시대인'),(224,'시도연구원협의회'),(225,'시드페이퍼'),(226,'시루'),(227,'시아출판'),(228,'신지평'),(229,'심플라이프'),(230,'쌤앤파커스'),(231,'아날로그'),(232,'아르테'),(233,'아름드리미디어'),(234,'아이세움'),(235,'알마'),(236,'알에이치코리아'),(237,'애드앤미디어'),(238,'애플북스'),(239,'앤써북'),(240,'양철북'),(241,'어른의시간'),(242,'어크로스'),(243,'에버리치홀딩스'),(244,'에이치투'),(245,'에이콘'),(246,'에코의서재'),(247,'엘도라도'),(248,'연합뉴스'),(249,'연합통신'),(250,'열린책들'),(251,'열음사'),(252,'영남퇴계학연구원'),(253,'영진.com'),(254,'영진닷컴'),(255,'예담'),(256,'예림당'),(257,'예문'),(258,'예문아카이브'),(259,'오늘'),(260,'오픈하우스'),(261,'올인피앤비'),(262,'와이즈베리'),(263,'와이즈베리(미래엔)'),(264,'우듬지'),(265,'우리교육'),(266,'우리학교'),(267,'움직이는서재'),(268,'웅진씽크빅'),(269,'웅진지식하우스'),(270,'웅진지식하우스(웅진씽크빅)'),(271,'원앤원콘텐츠그룹'),(272,'월간조선'),(273,'웨일북'),(274,'웨일북(whalebooks)'),(275,'웰북'),(276,'웰북스'),(277,'위고'),(278,'위너스북'),(279,'위즈덤하우스'),(280,'윌북'),(281,'유노라이프'),(282,'유노북스'),(283,'유엑스리뷰'),(284,'유유'),(285,'육문사'),(286,'율도국'),(287,'은행나무'),(288,'은행나무출판사'),(289,'을유문화사'),(290,'을파소'),(291,'이다'),(292,'이다미디어'),(293,'이데아'),(294,'이레'),(295,'이와우'),(296,'이제이북스'),(297,'이지'),(298,'이지스퍼블리싱'),(299,'이책'),(300,'인간희극'),(301,'인문사회과학출판인협의회'),(302,'인물과사상사'),(303,'인사이트'),(304,'인플루엔셜'),(305,'일송미디어'),(306,'자유문고'),(307,'자유아카데미'),(308,'자유정신사'),(309,'자음과모음'),(310,'재능출판'),(311,'전북대학교출판문화원'),(312,'전자신문사'),(313,'정민미디어'),(314,'정보문화사'),(315,'정부간행물제작소'),(316,'정신세계사'),(317,'정한책방'),(318,'제14회부산아시아경기대회조직위원회'),(319,'제우미디어'),(320,'젠토피아'),(321,'조달청'),(322,'조선북스'),(323,'조화로운삶'),(324,'좋은생각사람들'),(325,'주니어 김영사'),(326,'주니어김영사'),(327,'주니어랜덤'),(328,'중앙books'),(329,'중앙북스'),(330,'중앙일보사'),(331,'지식갤러리'),(332,'지식너머'),(333,'지식의날개'),(334,'지식의숲'),(335,'지식채널'),(336,'지형'),(337,'진선books'),(338,'차이정원'),(339,'창'),(340,'창비'),(341,'창작과 비평사'),(342,'책구루'),(343,'책세상'),(344,'책속물고기'),(345,'책으로 여는 세상'),(346,'책이있는마을'),(347,'책이있는풍경'),(348,'책읽는달'),(349,'책읽는수요일'),(350,'천년의상상'),(351,'철수와영희'),(352,'청림Life'),(353,'청림출판'),(354,'청어람미디어'),(355,'초록개구리'),(356,'추수밭'),(357,'카시오페아'),(358,'커뮤니케이션북스'),(359,'코리아헤럴드'),(360,'크라운출판사'),(361,'큰숲'),(362,'클라우드나인'),(363,'클라우드북스'),(364,'키움'),(365,'타래'),(366,'태일출판사'),(367,'토네이도'),(368,'통나무'),(369,'투데이북스'),(370,'트로이목마'),(371,'티더블유아이지'),(372,'파란정원'),(373,'파란정원(책먹는아이)'),(374,'파피에'),(375,'판미동'),(376,'팜파스'),(377,'팬덤북스'),(378,'펄북스'),(379,'페르소나'),(380,'페이퍼로드'),(381,'페이퍼스토리'),(382,'평사리'),(383,'포럼'),(384,'포르체'),(385,'푸른역사'),(386,'풀빛'),(387,'프런티어'),(388,'프로방스'),(389,'프로파간다'),(390,'프뢰벨'),(391,'프리윌출판사'),(392,'플루토'),(393,'필로소픽'),(394,'필름(Feelm)'),(395,'하늘눈'),(396,'학교도서관저널'),(397,'학원출판공사'),(398,'학지사'),(399,'한강문학'),(400,'한겨레'),(401,'한겨레신문사'),(402,'한겨레출판'),(403,'한국경제신문'),(404,'한국경제신문 한경BP'),(405,'한국경제신문사'),(406,'한국문헌정보학회'),(407,'한국사진기자회'),(408,'한국전산원'),(409,'한국정신문화연구원'),(410,'한국지역발전연구재단'),(411,'한국톨스토이'),(412,'한국편집기자협의회'),(413,'한국편집기자협회'),(414,'한국편집보도기자클럽'),(415,'한국학술정보'),(416,'한권의책'),(417,'한길사'),(418,'한문화멀티미디어'),(419,'한빛라이프'),(420,'한빛미디어'),(421,'한빛비즈'),(422,'한빛아카데미'),(423,'한솔교육'),(424,'한솔수북'),(425,'한언'),(426,'한영출판사'),(427,'한울림'),(428,'한울아카데미'),(429,'해냄'),(430,'해냄출판사'),(431,'행복우물'),(432,'헥소미아'),(433,'현암사'),(434,'형설아이'),(435,'혜지원'),(436,'호밀밭'),(437,'홍신문화사'),(438,'홍익'),(439,'홍익출판사'),(440,'황금가지'),(441,'황금거북'),(442,'효리원'),(443,'휴머니스트'),(444,'휴먼사이언스'),(445,'흐름'),(446,'흐름출판'),(447,'大明出版社'),(448,'大邱廣域市立中央圖書館'),(449,'大邱直轄市'),(450,'大邱直轄市 北區'),(451,'大邱直轄市立中央圖書館'),(452,'嶺南專門大學'),(453,'東亞日報社'),(454,'每日新聞社'),(455,'知와사랑'),(456,'聯合通信'),(457,'行政自治部 政府記錄保存所'),(458,'韓國編輯記者會');
/*!40000 ALTER TABLE `publisher_mst` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-01-20 17:44:41
